JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 *  PA0 -> ADC1 -> DMA -> raw_sensor_value[0] -> characterized sensor outputs
 *			^
 *			|
 * 			TIM2
 *
 *	ClosedLoop/OpenLoop Operation Mode -> dutyCycle -> PWM
 *
 *
 */

/*
 * USART 2->STLINK
 *
 * TX->PA2
 * RX->PA3
 *
 */

#include <string.h>
#include "stm32f446xx.h"

uint16_t seno[160] = {4374, 4202, 4031, 3860, 3690, 3521, 3353, 3187, 3022, 2860, 2700, 2543, 2388, 2237, 2088, 1944, 1803, 1666, 1533, 1405, 1281, 1162, 1048, 939, 835, 737, 644, 557, 476, 401, 332, 270, 214, 164, 120, 84, 53, 30, 13, 3, 0, 3, 13, 30, 53, 84, 120, 164, 214, 270, 332, 401, 476, 557, 644, 737, 835, 939, 1048, 1162, 1281, 1405, 1533, 1666, 1803, 1944, 2088, 2237, 2388, 2543, 2700, 2860, 3022, 3187, 3353, 3521, 3690, 3860, 4031, 4202, 4374, 4546, 4717, 4888, 5058, 5227, 5395, 5561, 5726, 5888, 6048, 6205, 6360, 6511, 6660, 6804, 6945, 7082, 7215, 7343, 7467, 7586, 7700, 7809, 7913, 8011, 8104, 8191, 8272, 8347, 8416, 8478, 8534, 8584, 8628, 8664, 8695, 8718, 8735, 8745, 8749, 8745, 8735, 8718, 8695, 8664, 8628, 8584, 8534, 8478, 8416, 8347, 8272, 8191, 8104, 8011, 7913, 7809, 7700, 7586, 7467, 7343, 7215, 7082, 6945, 6804, 6660, 6511, 6360, 6205, 6048, 5888, 5726, 5561, 5395, 5227, 5058, 4888, 4717, 4546};

uint16_t seno2[160] = {4374, 4546, 4717, 4888, 5058, 5227, 5395, 5561, 5726, 5888, 6048, 6205, 6360, 6511, 6660, 6804, 6945, 7082, 7215, 7343, 7467, 7586, 7700, 7809, 7913, 8011, 8104, 8191, 8272, 8347, 8416, 8478, 8534, 8584, 8628, 8664, 8695, 8718, 8735, 8745, 8749, 8745, 8735, 8718, 8695, 8664, 8628, 8584, 8534, 8478, 8416, 8347, 8272, 8191, 8104, 8011, 7913, 7809, 7700, 7586, 7467, 7343, 7215, 7082, 6945, 6804, 6660, 6511, 6360, 6205, 6048, 5888, 5726, 5561, 5395, 5227, 5058, 4888, 4717, 4546, 4374, 4202, 4031, 3860, 3690, 3521, 3353, 3187, 3022, 2860, 2700, 2543, 2388, 2237, 2088, 1944, 1803, 1666, 1533, 1405, 1281, 1162, 1048, 939, 835, 737, 644, 557, 476, 401, 332, 270, 214, 164, 120, 84, 53, 30, 13, 3, 0, 3, 13, 30, 53, 84, 120, 164, 214, 270, 332, 401, 476, 557, 644, 737, 835, 939, 1048, 1162, 1281, 1405, 1533, 1666, 1803, 1944, 2088, 2237, 2388, 2543, 2700, 2860, 3022, 3187, 3353, 3521, 3690, 3860, 4031, 4202};

uint64_t BUFFER_SIZE = 9;

/*characterized sensor outputs*/
float v_cd;
float v_g;
float i_L;
float i_L90;
float i_inv;

float ElapsedTime=0;	//Elapsed time variable

char packets_keys[] = {'V','C','F','D','Z','S','X','N'};
float packets_value[5]; 	//Data packet to be sent via UART
int valid_send = 1;		//Flag to indicate when data packet is ready to be sent

uint8_t status = 0b00000000; //Status variable to monitor system states
uint8_t frequency = 96;

uint8_t receive_data[3];

/*sine wave for DQ and power-factor correction*/
float cosine;
float sine;

float i_Q;


/*modulator signal*/
__vo uint16_t u_control_pos;
__vo uint16_t u_control_neg;


uint8_t OPERATION_MODE = 0;

GPIO_Handle_t PWM_EN;
GPIO_Handle_t LOOP_SEL;

/*GPIO pins 14-15 from port B are declared as input that activate EXTI15_10 to control PWM on/off, as well as change Operation Mode*/
void Utility_GPIOInits(void)
{
	GPIO_PClkC(GPIOB, ENABLE);
	PWM_EN.pGPIOx = GPIOB;
	PWM_EN.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	PWM_EN.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_RFT;
	PWM_EN.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&PWM_EN);

	LOOP_SEL.pGPIOx = GPIOB;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_RFT;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&LOOP_SEL);

	GPIO_IRQInterruptConfig(IRQ_NO_EXTI15_10,ENABLE);
	GPIO_IRQPriorityConfig(IRQ_NO_EXTI15_10, 0);
}

GPIO_Handle_t GpioPWMA;
GPIO_Handle_t GpioPWMB;

/*GPIO pin 7 from port C and GPIO pin 6 from port B are declared as High Output Speed for PWM signals*/
void PWM_GPIOInits(void)
{
	GPIO_PClkC(GPIOB, ENABLE);

	GpioPWMA.pGPIOx = GPIOB;
	GpioPWMA.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GpioPWMA.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	GpioPWMA.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	GpioPWMA.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioPWMA.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioPWMA.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioPWMA);

	GpioPWMB.pGPIOx = GPIOB;
	GpioPWMB.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GpioPWMB.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	GpioPWMB.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	GpioPWMB.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioPWMB.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioPWMB.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioPWMB);
}

GPIO_Handle_t GPIO_Sensor[4];
ADC_Handle_t ADC_1;
DMA_Handle_t DMA2_ADC1Handle;
uint32_t raw_sensor_value[4];												//ADC1 destination buffer
float	sensor[9][4];														//processed data buffer (?)

/*Add as much sensors you want to read (look up pinout for compatibility) */

void Sensors_Init(void) /*For this application only 4 sensors will be initialized (name may be changed)*/
{
	/*****************GPIO analog inputs initialization*****************/
	GPIO_PClkC(GPIOA, ENABLE);

	GPIO_Sensor[0].pGPIOx = GPIOA;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ANALOG;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GPIO_Sensor[0]);

	GPIO_Sensor[1].pGPIOx = GPIOA;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ANALOG;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_1;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GPIO_Sensor[1]);

